benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/tcpdump-benchmark-1400.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  5 threads and 300 connections
  Thread calibration: mean lat.: 0.946ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.957ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.941ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.954ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.969ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.92ms  628.77us   1.31ms   99.37%
    Req/Sec   298.13    179.22   777.00     61.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    0.92ms
 90.000%    0.98ms
 99.000%    1.31ms
 99.900%   13.22ms
 99.990%   20.53ms
 99.999%   21.61ms
100.000%   23.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.712     0.000000            1         1.00
       0.803     0.100000         7037         1.11
       0.822     0.200000        14391         1.25
       0.837     0.300000        21210         1.43
       0.852     0.400000        28360         1.67
       0.867     0.500000        35145         2.00
       0.875     0.550000        38582         2.22
       0.884     0.600000        42093         2.50
       0.894     0.650000        45625         2.86
       0.905     0.700000        49084         3.33
       0.918     0.750000        52643         4.00
       0.926     0.775000        54475         4.44
       0.934     0.800000        56142         5.00
       0.944     0.825000        57850         5.71
       0.956     0.850000        59651         6.67
       0.969     0.875000        61430         8.00
       0.976     0.887500        62246         8.89
       0.984     0.900000        63087        10.00
       0.994     0.912500        63968        11.43
       1.007     0.925000        64867        13.33
       1.022     0.937500        65764        16.00
       1.030     0.943750        66172        17.78
       1.040     0.950000        66618        20.00
       1.051     0.956250        67038        22.86
       1.065     0.962500        67463        26.67
       1.083     0.968750        67902        32.00
       1.096     0.971875        68134        35.56
       1.109     0.975000        68351        40.00
       1.126     0.978125        68567        45.71
       1.145     0.981250        68781        53.33
       1.175     0.984375        68996        64.00
       1.195     0.985938        69108        71.11
       1.220     0.987500        69215        80.00
       1.265     0.989062        69326        91.43
       1.342     0.990625        69435       106.67
       1.468     0.992188        69544       128.00
       1.506     0.992969        69599       142.22
       1.553     0.993750        69654       160.00
       1.613     0.994531        69708       182.86
       1.732     0.995313        69763       213.33
       2.259     0.996094        69818       256.00
       2.853     0.996484        69846       284.44
       3.437     0.996875        69872       320.00
       4.535     0.997266        69900       365.71
       6.339     0.997656        69927       426.67
       8.559     0.998047        69955       512.00
       9.623     0.998242        69968       568.89
      11.239     0.998437        69982       640.00
      11.791     0.998633        69996       731.43
      12.519     0.998828        70010       853.33
      13.343     0.999023        70023      1024.00
      13.871     0.999121        70030      1137.78
      14.239     0.999219        70037      1280.00
      15.239     0.999316        70044      1462.86
      15.647     0.999414        70050      1706.67
      16.023     0.999512        70057      2048.00
      16.607     0.999561        70061      2275.56
      17.007     0.999609        70064      2560.00
      17.663     0.999658        70068      2925.71
      17.887     0.999707        70072      3413.33
      18.207     0.999756        70074      4096.00
      18.287     0.999780        70076      4551.11
      18.463     0.999805        70078      5120.00
      18.639     0.999829        70080      5851.43
      18.831     0.999854        70081      6826.67
      19.951     0.999878        70083      8192.00
      20.527     0.999890        70084      9102.22
      20.543     0.999902        70085     10240.00
      20.815     0.999915        70086     11702.86
      20.815     0.999927        70086     13653.33
      20.879     0.999939        70087     16384.00
      21.295     0.999945        70088     18204.44
      21.295     0.999951        70088     20480.00
      21.567     0.999957        70089     23405.71
      21.567     0.999963        70089     27306.67
      21.567     0.999969        70089     32768.00
      21.615     0.999973        70090     36408.89
      21.615     0.999976        70090     40960.00
      21.615     0.999979        70090     46811.43
      21.615     0.999982        70090     54613.33
      21.615     0.999985        70090     65536.00
      23.167     0.999986        70091     72817.78
      23.167     1.000000        70091          inf
#[Mean    =        0.918, StdDeviation   =        0.629]
#[Max     =       23.152, Total count    =        70091]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  82659 requests in 1.00m, 15.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:   1377.57
Transfer/sec:    267.71KB