benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/tcpdump-benchmark-3000.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  5 threads and 700 connections
  Thread calibration: mean lat.: 1.072ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.115ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.019ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.033ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.046ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.93ms  561.69us   1.62ms   98.53%
    Req/Sec   636.76    260.34     1.33k    69.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    0.96ms
 90.000%    1.09ms
 99.000%    1.62ms
 99.900%   10.99ms
 99.990%   18.94ms
 99.999%   22.11ms
100.000%   23.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.677     0.000000            1         1.00
       0.769     0.100000        15510         1.11
       0.793     0.200000        30025         1.25
       0.817     0.300000        45493         1.43
       0.840     0.400000        60011         1.67
       0.866     0.500000        75233         2.00
       0.880     0.550000        82626         2.22
       0.896     0.600000        90172         2.50
       0.914     0.650000        97817         2.86
       0.934     0.700000       105155         3.33
       0.958     0.750000       112516         4.00
       0.973     0.775000       116501         4.44
       0.989     0.800000       120192         5.00
       1.006     0.825000       123807         5.71
       1.028     0.850000       127648         6.67
       1.053     0.875000       131308         8.00
       1.069     0.887500       133153         8.89
       1.088     0.900000       135070        10.00
       1.110     0.912500       136899        11.43
       1.135     0.925000       138823        13.33
       1.165     0.937500       140661        16.00
       1.182     0.943750       141593        17.78
       1.205     0.950000       142558        20.00
       1.230     0.956250       143458        22.86
       1.263     0.962500       144423        26.67
       1.304     0.968750       145346        32.00
       1.329     0.971875       145815        35.56
       1.358     0.975000       146285        40.00
       1.393     0.978125       146743        45.71
       1.434     0.981250       147213        53.33
       1.480     0.984375       147679        64.00
       1.508     0.985938       147915        71.11
       1.542     0.987500       148146        80.00
       1.593     0.989062       148387        91.43
       1.647     0.990625       148614       106.67
       1.718     0.992188       148851       128.00
       1.762     0.992969       148966       142.22
       1.826     0.993750       149084       160.00
       1.923     0.994531       149200       182.86
       2.093     0.995313       149317       213.33
       2.639     0.996094       149434       256.00
       2.995     0.996484       149493       284.44
       3.493     0.996875       149552       320.00
       3.967     0.997266       149610       365.71
       4.987     0.997656       149669       426.67
       6.663     0.998047       149727       512.00
       7.659     0.998242       149757       568.89
       8.639     0.998437       149786       640.00
       9.639     0.998633       149815       731.43
      10.367     0.998828       149845       853.33
      11.095     0.999023       149874      1024.00
      11.871     0.999121       149889      1137.78
      12.671     0.999219       149903      1280.00
      13.431     0.999316       149918      1462.86
      13.951     0.999414       149933      1706.67
      14.711     0.999512       149948      2048.00
      15.007     0.999561       149955      2275.56
      15.407     0.999609       149962      2560.00
      15.727     0.999658       149970      2925.71
      16.087     0.999707       149977      3413.33
      16.495     0.999756       149984      4096.00
      16.719     0.999780       149989      4551.11
      17.215     0.999805       149991      5120.00
      17.631     0.999829       149995      5851.43
      17.935     0.999854       149999      6826.67
      18.191     0.999878       150002      8192.00
      18.559     0.999890       150004      9102.22
      18.975     0.999902       150006     10240.00
      20.175     0.999915       150008     11702.86
      20.639     0.999927       150010     13653.33
      20.703     0.999939       150011     16384.00
      20.799     0.999945       150012     18204.44
      21.103     0.999951       150013     20480.00
      21.311     0.999957       150014     23405.71
      21.423     0.999963       150015     27306.67
      21.759     0.999969       150016     32768.00
      21.759     0.999973       150016     36408.89
      21.807     0.999976       150017     40960.00
      21.807     0.999979       150017     46811.43
      22.111     0.999982       150018     54613.33
      22.111     0.999985       150018     65536.00
      22.111     0.999986       150018     72817.78
      23.087     0.999988       150019     81920.00
      23.087     0.999989       150019     93622.86
      23.087     0.999991       150019    109226.67
      23.087     0.999992       150019    131072.00
      23.087     0.999993       150019    145635.56
      23.247     0.999994       150020    163840.00
      23.247     1.000000       150020          inf
#[Mean    =        0.933, StdDeviation   =        0.562]
#[Max     =       23.232, Total count    =       150020]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  177233 requests in 1.00m, 33.64MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:   2954.48
Transfer/sec:    574.16KB